/*
* TODO: 1.	Создайте и наймите в компанию: 180 операторов Operator, 80 менеджеров по продажам Manager, 10 топ-менеджеров TopManager.
        2.	Распечатайте список из 10–15 самых высоких зарплат в компании.
        3.	Распечатайте список из 30 самых низких зарплат в компании.
        4.	Увольте 50% сотрудников.
        5.	Распечатайте список из 10–15 самых высоких зарплат в компании.
        6.	Распечатайте список из 30 самых низких зарплат в компании.
* */
public class Main {
    public static void main(String[] args) {

    }
}
